In [72]:
import pandas as pd
import numpy as np

In [73]:
df = pd.read_csv('adult.csv')

In [3]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.shape

(32561, 15)

In [5]:
df.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
salary            object
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [7]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

#### 1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [8]:
df.sex.value_counts(normalize=True)

Male      0.669205
Female    0.330795
Name: sex, dtype: float64

#### 2. Каков средний возраст (признак age) женщин?

In [18]:
df[df.sex == 'Female'].age.mean().round(2)
# pandas.mean() 
# skipna : boolean, default True
#     Exclude NA/null values when computing the result.

36.86

#### 3. Какова доля граждан Германии (признак native-country)?

In [23]:
df['native-country'].value_counts(normalize=True).head()

United-States    0.895857
Mexico           0.019748
?                0.017905
Philippines      0.006081
Germany          0.004207
Name: native-country, dtype: float64

#### 4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

In [26]:
df.salary.unique()

array(['<=50K', '>50K'], dtype=object)

In [28]:
df.groupby('salary')['age'].mean().round(2)

salary
<=50K    36.78
>50K     44.25
Name: age, dtype: float64

In [29]:
df.groupby('salary')['age'].std().round(2)

salary
<=50K    14.02
>50K     10.52
Name: age, dtype: float64

In [74]:
df.groupby('salary')['age'].agg({'mean': 'mean', 'std': 'std'})

/home/boozzee/.virtualenvs/test/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

             mean        std
salary
<=50K   36.783738  14.020088
>50K    44.249841  10.519028

In [71]:
# Pandas использует несмещенную оценку (N-1 в знаменателе), 
# тогда как Numpy по умолчанию не делает.
arr = np.arange(10)
np_std = np.std(arr)
pd_std = pd.DataFrame(arr).std()[0]
print(f'numpy std: {np_std}, pandas std: {pd_std}')

numpy std: 2.8722813232690143, pandas std: 3.0276503540974917

#### 6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [32]:
df[df.salary == '>50K'].education.unique()

array(['HS-grad', 'Masters', 'Bachelors', 'Some-college', 'Assoc-voc',
       'Doctorate', 'Prof-school', 'Assoc-acdm', '7th-8th', '12th',
       '10th', '11th', '9th', '5th-6th', '1st-4th'], dtype=object)

#### 7. Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [35]:
df.groupby(['race', 'sex'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

#### 8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.

In [40]:
df.groupby(['salary'])['marital-status'].value_counts(normalize=True)

salary  marital-status
<=50K   Never-married            0.412298
        Married-civ-spouse       0.335113
        Divorced                 0.161003
        Separated                0.038794
        Widowed                  0.036731
        Married-spouse-absent    0.015534
        Married-AF-spouse        0.000526
>50K    Married-civ-spouse       0.853463
        Never-married            0.062620
        Divorced                 0.059049
        Widowed                  0.010840
        Separated                0.008417
        Married-spouse-absent    0.004336
        Married-AF-spouse        0.001275
Name: marital-status, dtype: float64

#### 9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [42]:
df['hours-per-week'].max()

99

In [48]:
df['hours-per-week'].value_counts()[df['hours-per-week'].value_counts().index == 99]

99    85
Name: hours-per-week, dtype: int64

In [50]:
df[df['hours-per-week'] == 99].salary.value_counts(normalize=True)

<=50K    0.705882
>50K     0.294118
Name: salary, dtype: float64

#### 10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).

In [55]:
hpw_by_country = df.groupby(['native-country', 'salary'])['hours-per-week'].mean()
pd.DataFrame(hpw_by_country).reset_index().head(10)

  native-country salary  hours-per-week
0              ?  <=50K       40.164760
1              ?   >50K       45.547945
2       Cambodia  <=50K       41.416667
3       Cambodia   >50K       40.000000
4         Canada  <=50K       37.914634
5         Canada   >50K       45.641026
6          China  <=50K       37.381818
7          China   >50K       38.900000
8       Columbia  <=50K       38.684211
9       Columbia   >50K       50.000000